import pandas as pd

data = [
    ['삼성', '1000', '2000'],
    ['현대', '1100', '3000'],
    ['엘지', '2000', '500'],
    ['아모레', '3500', '6000'],
    ['네이버', '100', '1500']
]

index = ['031', '059', '033', '045', '023']
columns = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index=index, columns=columns)
print(df)
#      종목명    시가    종가
# 031   삼성    1000    2000
# 059   현대    1100    3000
# 033   엘지    2000     500
# 045  아모레   3500    6000
# 023  네이버    100    1500

print(df['종목명']) # !!!!!!!!!! pandas 열행 !!!!!!!!!! numpy는 행 열 형태//
# 031     삼성
# 059     현대
# 033     엘지
# 045    아모레
# 023    네이버
# Name: 종목명, dtype: 

######################## 아모레 출력 ########################
# print(df[3,1])                    # 에러
# print(df['045'])                  # 에러
# print(df['045', '종목명'])        # 에러
# print(df[['045'], ['종목명']])    # 에러
print(df['종목명']['045'])          # !!!!! pandas 열행 !!!!!

# loc : 인덱스 기준으로 행 데이터 추출
# iloc : 행번호 기준으로 행 데이터 추출, int location이라고 외우자

print('\n', df.iloc[3])
print('\n', df.loc['045'])

######################## 네이버 출력 ########################
print(df['종목명']['023'])          # !!!!! pandas 열행 !!!!!
print('\n', df.iloc[4])
print('\n', df.loc['023'])

###################### 아모레 종가 출력 #####################
print(df.iloc[3][2])
print(df.iloc[3]['종가'])
print(df.iloc[3,2])
print(df.iloc[3].iloc[2])
print(df.iloc[3].loc['종가'])

print(df.loc['045']['종가'])
print(df.loc['045','종가'])
print(df.loc['045'][2])
print(df.loc['045'].iloc[2])

