import numpy as np
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense
import tensorflow as tf
import random

random.seed(333)
np.random.seed(333)
tf.random.set_seed(333)

# x = np.array([1,2,3,4,5])
# y = np.array([1,2,3,4,5])
x = np.array([1])
y = np.array([1])

#2. 모델
model = Sequential()
model.add(Dense(3, input_dim=1))
model.add(Dense(2))
model.add(Dense(1))

####################### 동결 ############################
# model.trainable = False       # 동결
model.trainable = True        # 비동결  default

print("=================================================================================================================================")

# print(model.weights)

print("=================================================================================================================================")

#3. 컴파일, 훈련
model.compile(loss='mse', optimizer='adam')
model.fit(x, y, batch_size=1, epochs=1000, verbose=0)

#4. 평가, 예측
y_pred = model.predict(x)
print(y_pred)


print("=================================================================================================================================")

print(model.weights)

print("=================================================================================================================================")
# 비동결
# [[1.0000001]
#  [1.9999999]
#  [3.0000002]
#  [4.       ]
#  [4.9999995]]

# 동결   : 훈련 X 가중치 변화 X
# [[0.45656443]
#  [0.91312885]
#  [1.369693  ]
#  [1.8262577 ]
#  [2.282822  ]]

############################ 동결 손계산 ###################################
# x=1, y=1, 가중치동결 후 훈련 
# [[0.45656443]]

############################ 동결하지 않고 훈련한거 손계산 ###################################

